tsung/data/version2/20161201-0706/critical.xml
<?xml version="1.0"?><tsung loglevel="notice" version="1.0">

  <clients>
    <client host="localhost" use_controller_vm="true" maxusers="15000"/>
  </clients>

  <servers>
    <server host="35.164.234.80" port="80" type="tcp"/>
  </servers>


  <load>
    <arrivalphase phase="1" duration="30" unit="second">
      <users arrivalrate="1" unit="second"/>
    </arrivalphase>
    <arrivalphase phase="2" duration="30" unit="second">
      <users arrivalrate="2" unit="second"/>
    </arrivalphase>
    <arrivalphase phase="3" duration="30" unit="second">
      <users arrivalrate="4" unit="second"/>
    </arrivalphase>
   <arrivalphase phase="4" duration="30" unit="second">
     <users arrivalrate="8" unit="second"/>
   </arrivalphase>
   <arrivalphase phase="5" duration="30" unit="second">
     <users arrivalrate="16" unit="second"/>
   </arrivalphase>
   <arrivalphase phase="6" duration="30" unit="second">
     <users arrivalrate="32" unit="second"/>
   </arrivalphase>
   </load>

  <options>
    <option name="global_ack_timeout" value="2000"/>

    <option type="ts_http" name="user_agent">
      <user_agent probability="100">Mozilla/5.0 (Windows; U; Windows NT 5.2; fr-FR; rv:1.7.8) Gecko/20050511 Firefox/1.0.4</user_agent>
    </option>
  </options>

  <sessions>
    <session name="stats-viewer" probability="40" type="ts_http">

      <request>
        <http url="/" version="1.1" method="GET"/>
      </request>

      <thinktime value="2" random="true"/>

      <request>
        <http url="/tournaments/2" version="1.1" method="GET"/>
      </request>

      <thinktime value="2" random="true"/>

      <request>
        <http url="/matches/42" version="1.1" method="GET"/>
      </request>

      <thinktime value="5" random="true"/>

      <request>
        <http url="/tournaments/3" version="1.1" method="GET"/>
      </request>

      <thinktime value="2" random="true"/>

      <request>
        <http url="/clubs/1" version="1.1" method="GET"/>
      </request>

      <thinktime value="5" random="true"/>

      <request>
        <http url="/players/1" version="1.1" method="GET"/>
      </request>

      <thinktime value="5" random="true"/>

    </session>

    <session name="search-viewer" probability="30" type="ts_http">

      <request>
        <http url="/" version="1.1" method="GET"/>
      </request>

      <thinktime value="2" random="true"/>

      <request>
        <http url="/players?utf8=%E2%9C%93&amp;search=Julie&amp;commit=Search" version="1.1" method="GET"/>
      </request>

      <thinktime value="2" random="true"/>

      <request>
        <http url="/players/5" version="1.1" method="GET"/>
      </request>

      <thinktime value="4" random="true"/>
    </session>

    <session name="news-session" probability="30" type="ts_http">

      <request>
        <http url="/" version="1.1" method="GET"/>
      </request>

      <thinktime value="2" random="true"/>

      <request>
        <http url="/news" version="1.1" method="GET"/>
      </request>

      <thinktime value="2" random="true"/>

      <request>
        <http url="/news/new" version="1.1" method="GET"/>
      </request>

      <thinktime value="10" random="true"/>

      <request>
        <dyn_variable name="created_news_id" re="[Ll]ocation: http://.*/news/(.*)\r"/>
        <http url="/news" version="1.1" method="POST" contents="utf8=%E2%9C%93&amp;news=%5Bnewslink%5D=newlink&amp;                                                                 news%5Btitle%5D=Title&amp;                                                                 news%5Bsubtext%5D=Why&amp;                                                                 news%5Bimglink%5D=imagelink&amp;                                                                   commit=Create+New"/>
      </request>

      <request>
        <http url="/news/%%_created_news_id%%/edit" version="1.1" method="GET"/>
      </request>

      <thinktime value="5" random="true"/>

      <request>
        <http url="/news/%%_created_news_id%%" version="1.1" method="PATCH" contents="utf8=%E2%9C%93&amp;news=%5Bnewslink%5D=newlink&amp;                                                                 news%5Btitle%5D=NewTitle&amp;                                                                 news%5Bsubtext%5D=Why&amp;                                                                 news%5Bimglink%5D=Newimagelink&amp;                                                                   commit=Update+New"/>
      </request>

      <thinktime value="2" random="true"/>

      <request>
        <http url="/news/%%_created_news_id%%" version="1.1" method="DELETE"/>
      </request>

    </session>

  </sessions>
</tsung>